In [9]:
import pandas as pd

df1 =  pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

In [ ]:
# One To One

In [10]:
OneToOne = pd.merge(df1, df2)

In [12]:
OneToOne

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

In [13]:
# Many to one

In [15]:
orders =  pd.DataFrame({
    'OrderID': [101, 102, 103, 104],
    'UserID': [1, 2, 1, 3],  # Note the duplicate UserID values
    'OrderDetail': ['Book', 'Laptop', 'Pen', 'Notebook']
})

users =  pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

manyToOne = pd.merge(orders, users)

In [17]:
manyToOne

   OrderID  UserID OrderDetail UserName
0      101       1        Book    Alice
1      103       1         Pen    Alice
2      102       2      Laptop      Bob
3      104       3    Notebook  Charlie

In [18]:
# Many to many

In [24]:
userDf = pd.DataFrame({
    'UserID': [1, 2, 1, 3, 2],
    'ProjectID': ['A', 'A', 'B', 'B', 'C']  # Note: Projects A and B involve multiple users
})

projectDf = pd.DataFrame({
    'ProjectID': ['A', 'A', 'B', 'C', 'C'],
    'Detail': ['Phase 1', 'Phase 2', 'Initial', 'Planning', 'Execution']  # Note: Projects A and C have multiple phases/details
})

ManyToMany = pd.merge(userDf, projectDf, on = 'ProjectID', how = "inner")

In [26]:
ManyToMany

   UserID ProjectID     Detail
0       1         A    Phase 1
1       1         A    Phase 2
2       2         A    Phase 1
3       2         A    Phase 2
4       1         B    Initial
5       3         B    Initial
6       2         C   Planning
7       2         C  Execution

In [27]:
# on keyword

In [30]:
userName = pd.DataFrame({
    'UserID': [1, 2, 3],
    'UserName': ['Alice', 'Bob', 'Charlie']
})

# Sample DataFrame 2: Emails
emailName = pd.DataFrame({
    'UserID': [2, 3, 1],
    'Email': ['bob@example.com', 'charlie@example.com', 'alice@example.com']
})

x = pd.merge(userName, emailName, on = 'UserID')

In [32]:
x

   UserID UserName                Email
0       1    Alice    alice@example.com
1       2      Bob      bob@example.com
2       3  Charlie  charlie@example.com

In [3]:
# The left_on and right_on Keywords
import pandas as pd
employeDf = pd.DataFrame({
    'EmpID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Sample DataFrame 2: Salaries
salaryDf = pd.DataFrame({
    'EmployeeRef': [102, 103, 104],
    'Salary': [70000, 80000, 90000]
})

join = pd.merge( employeDf, salaryDf, left_on = "EmpID", right_on = "EmployeeRef" )

print(join)

   EmpID     Name  EmployeeRef  Salary
0    102      Bob          102   70000
1    103  Charlie          103   80000

In [9]:
# The left_index and right_index keywords
employeeNamesDf = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
}, index=[101, 102, 103, 104])  # Employee IDs as index

employeeSalariesDf = pd.DataFrame({
    'Salary': [70000, 80000, 90000, 60000]
}, index=[103, 104, 105, 106])  # Employee IDs as index

y = pd.merge(employeeNamesDf, employeeSalariesDf, left_index = True, right_index= True)
print(y)

        Name  Salary
103  Charlie   70000
104    David   80000

In [3]:
import pandas as pd
# How Keyword

emp = pd.DataFrame({
    'EmployeeID': [101, 102, 103, 104],
    'EmployeeName': ['Alice', 'Bob', 'Charlie', 'David']
})

deprt =  pd.DataFrame({
    'EmployeeID': [101, 103, 104, 105],
    'Department': ['HR', 'IT', 'Finance', 'Marketing']
})

In [5]:
pd.merge(emp, deprt, on = "EmployeeID", how = "left" )

   EmployeeID EmployeeName Department
0         101        Alice         HR
1         102          Bob        NaN
2         103      Charlie         IT
3         104        David    Finance

In [6]:
pd.merge(emp, deprt, on = "EmployeeID", how = "right" )

   EmployeeID EmployeeName Department
0         101        Alice         HR
1         103      Charlie         IT
2         104        David    Finance
3         105          NaN  Marketing

In [7]:
pd.merge(emp, deprt, on = "EmployeeID" )

   EmployeeID EmployeeName Department
0         101        Alice         HR
1         103      Charlie         IT
2         104        David    Finance

In [10]:
# Ex. 2
stud = pd.DataFrame({
    'Roll No': [1, 2, 3, 4],
    'Student Name': ['Ravi', 'Shoyeb', 'Durgesh', 'Yash']
})

# Sample DataFrame 2: Departments
course = pd.DataFrame({
    'Roll No': [2, 3],
    'Course': ['Data Science', 'Calculus']
})

In [12]:
pd.merge(stud, course, on = "Roll No", how = "inner")

   Roll No Student Name        Course
0        2       Shoyeb  Data Science
1        3      Durgesh      Calculus

In [14]:
print(pd.merge(stud, course, on = "Roll No", how = "outer"))

   Roll No Student Name        Course
0        1         Ravi           NaN
1        2       Shoyeb  Data Science
2        3      Durgesh      Calculus
3        4         Yash           NaN